MikroElektronika/core_packages/PIC/XC8/def/PIC16F707/mcu.h
extern volatile ADCON1bits_t ADCON1bits __at(0x09F);
// bitfield macros
#define _ADCON1_ADREF_POSN                                  0x0
#define _ADCON1_ADREF_POSITION                              0x0
#define _ADCON1_ADREF_SIZE                                  0x2
#define _ADCON1_ADREF_LENGTH                                0x2
#define _ADCON1_ADREF_MASK                                  0x3
#define _ADCON1_ADCS_POSN                                   0x4
#define _ADCON1_ADCS_POSITION                               0x4
#define _ADCON1_ADCS_SIZE                                   0x3
#define _ADCON1_ADCS_LENGTH                                 0x3
#define _ADCON1_ADCS_MASK                                   0x70
#define _ADCON1_ADREF0_POSN                                 0x0
#define _ADCON1_ADREF0_POSITION                             0x0
#define _ADCON1_ADREF0_SIZE                                 0x1
#define _ADCON1_ADREF0_LENGTH                               0x1
#define _ADCON1_ADREF0_MASK                                 0x1
#define _ADCON1_ADREF1_POSN                                 0x1
#define _ADCON1_ADREF1_POSITION                             0x1
#define _ADCON1_ADREF1_SIZE                                 0x1
#define _ADCON1_ADREF1_LENGTH                               0x1
#define _ADCON1_ADREF1_MASK                                 0x2
#define _ADCON1_ADCS0_POSN                                  0x4
#define _ADCON1_ADCS0_POSITION                              0x4
#define _ADCON1_ADCS0_SIZE                                  0x1
#define _ADCON1_ADCS0_LENGTH                                0x1
#define _ADCON1_ADCS0_MASK                                  0x10
#define _ADCON1_ADCS1_POSN                                  0x5
#define _ADCON1_ADCS1_POSITION                              0x5
#define _ADCON1_ADCS1_SIZE                                  0x1
#define _ADCON1_ADCS1_LENGTH                                0x1
#define _ADCON1_ADCS1_MASK                                  0x20
#define _ADCON1_ADCS2_POSN                                  0x6
#define _ADCON1_ADCS2_POSITION                              0x6
#define _ADCON1_ADCS2_SIZE                                  0x1
#define _ADCON1_ADCS2_LENGTH                                0x1
#define _ADCON1_ADCS2_MASK                                  0x40

// Register: TACON
#define TACON TACON
extern volatile unsigned char           TACON               __at(0x105);
#ifndef _LIB_BUILD
asm("TACON equ 0105h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TAPS                   :3;
        unsigned TAPSA                  :1;
        unsigned TASE                   :1;
        unsigned TACS                   :1;
        unsigned                        :1;
        unsigned TMRAON                 :1;
    };
    struct {
        unsigned TAPS0                  :1;
        unsigned TAPS1                  :1;
        unsigned TAPS2                  :1;
    };
    struct {
        unsigned TMRAPS                 :3;
        unsigned TMRAPSA                :1;
        unsigned TMRASE                 :1;
        unsigned TMRACS                 :1;
    };
    struct {
        unsigned TMRAPS0                :1;
        unsigned TMRAPS1                :1;
        unsigned TMRAPS2                :1;
    };
} TACONbits_t;
extern volatile TACONbits_t TACONbits __at(0x105);
// bitfield macros
#define _TACON_TAPS_POSN                                    0x0
#define _TACON_TAPS_POSITION                                0x0
#define _TACON_TAPS_SIZE                                    0x3
#define _TACON_TAPS_LENGTH                                  0x3
#define _TACON_TAPS_MASK                                    0x7
#define _TACON_TAPSA_POSN                                   0x3
#define _TACON_TAPSA_POSITION                               0x3
#define _TACON_TAPSA_SIZE                                   0x1
#define _TACON_TAPSA_LENGTH                                 0x1
#define _TACON_TAPSA_MASK                                   0x8
#define _TACON_TASE_POSN                                    0x4
#define _TACON_TASE_POSITION                                0x4
#define _TACON_TASE_SIZE                                    0x1
#define _TACON_TASE_LENGTH                                  0x1
#define _TACON_TASE_MASK                                    0x10
#define _TACON_TACS_POSN                                    0x5
#define _TACON_TACS_POSITION                                0x5
#define _TACON_TACS_SIZE                                    0x1
#define _TACON_TACS_LENGTH                                  0x1
#define _TACON_TACS_MASK                                    0x20
#define _TACON_TMRAON_POSN                                  0x7
#define _TACON_TMRAON_POSITION                              0x7
#define _TACON_TMRAON_SIZE                                  0x1
#define _TACON_TMRAON_LENGTH                                0x1
#define _TACON_TMRAON_MASK                                  0x80
#define _TACON_TAPS0_POSN                                   0x0
#define _TACON_TAPS0_POSITION                               0x0
#define _TACON_TAPS0_SIZE                                   0x1
#define _TACON_TAPS0_LENGTH                                 0x1
#define _TACON_TAPS0_MASK                                   0x1
#define _TACON_TAPS1_POSN                                   0x1
#define _TACON_TAPS1_POSITION                               0x1
#define _TACON_TAPS1_SIZE                                   0x1
#define _TACON_TAPS1_LENGTH                                 0x1
#define _TACON_TAPS1_MASK                                   0x2
#define _TACON_TAPS2_POSN                                   0x2
#define _TACON_TAPS2_POSITION                               0x2
#define _TACON_TAPS2_SIZE                                   0x1
#define _TACON_TAPS2_LENGTH                                 0x1
#define _TACON_TAPS2_MASK                                   0x4
#define _TACON_TMRAPS_POSN                                  0x0
#define _TACON_TMRAPS_POSITION                              0x0
#define _TACON_TMRAPS_SIZE                                  0x3
#define _TACON_TMRAPS_LENGTH                                0x3
#define _TACON_TMRAPS_MASK                                  0x7
#define _TACON_TMRAPSA_POSN                                 0x3
#define _TACON_TMRAPSA_POSITION                             0x3
#define _TACON_TMRAPSA_SIZE                                 0x1
#define _TACON_TMRAPSA_LENGTH                               0x1
#define _TACON_TMRAPSA_MASK                                 0x8
#define _TACON_TMRASE_POSN                                  0x4
#define _TACON_TMRASE_POSITION                              0x4
#define _TACON_TMRASE_SIZE                                  0x1
#define _TACON_TMRASE_LENGTH                                0x1
#define _TACON_TMRASE_MASK                                  0x10
#define _TACON_TMRACS_POSN                                  0x5
#define _TACON_TMRACS_POSITION                              0x5
#define _TACON_TMRACS_SIZE                                  0x1
#define _TACON_TMRACS_LENGTH                                0x1
#define _TACON_TMRACS_MASK                                  0x20
#define _TACON_TMRAPS0_POSN                                 0x0
#define _TACON_TMRAPS0_POSITION                             0x0
#define _TACON_TMRAPS0_SIZE                                 0x1
#define _TACON_TMRAPS0_LENGTH                               0x1
#define _TACON_TMRAPS0_MASK                                 0x1
#define _TACON_TMRAPS1_POSN                                 0x1
#define _TACON_TMRAPS1_POSITION                             0x1
#define _TACON_TMRAPS1_SIZE                                 0x1
#define _TACON_TMRAPS1_LENGTH                               0x1
#define _TACON_TMRAPS1_MASK                                 0x2
#define _TACON_TMRAPS2_POSN                                 0x2
#define _TACON_TMRAPS2_POSITION                             0x2
#define _TACON_TMRAPS2_SIZE                                 0x1
#define _TACON_TMRAPS2_LENGTH                               0x1
#define _TACON_TMRAPS2_MASK                                 0x4

