MikroElektronika/core_packages/PIC/XC8/def/PIC16F707/mcu.h
// Register: CPSBCON0
#define CPSBCON0 CPSBCON0
extern volatile unsigned char           CPSBCON0            __at(0x106);
#ifndef _LIB_BUILD
asm("CPSBCON0 equ 0106h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TBXCS                  :1;
        unsigned CPSBOUT                :1;
        unsigned CPSBRNG                :2;
        unsigned                        :2;
        unsigned CPSBRM                 :1;
        unsigned CPSBON                 :1;
    };
    struct {
        unsigned                        :2;
        unsigned CPSBRNG0               :1;
        unsigned CPSBRNG1               :1;
    };
} CPSBCON0bits_t;
extern volatile CPSBCON0bits_t CPSBCON0bits __at(0x106);
// bitfield macros
#define _CPSBCON0_TBXCS_POSN                                0x0
#define _CPSBCON0_TBXCS_POSITION                            0x0
#define _CPSBCON0_TBXCS_SIZE                                0x1
#define _CPSBCON0_TBXCS_LENGTH                              0x1
#define _CPSBCON0_TBXCS_MASK                                0x1
#define _CPSBCON0_CPSBOUT_POSN                              0x1
#define _CPSBCON0_CPSBOUT_POSITION                          0x1
#define _CPSBCON0_CPSBOUT_SIZE                              0x1
#define _CPSBCON0_CPSBOUT_LENGTH                            0x1
#define _CPSBCON0_CPSBOUT_MASK                              0x2
#define _CPSBCON0_CPSBRNG_POSN                              0x2
#define _CPSBCON0_CPSBRNG_POSITION                          0x2
#define _CPSBCON0_CPSBRNG_SIZE                              0x2
#define _CPSBCON0_CPSBRNG_LENGTH                            0x2
#define _CPSBCON0_CPSBRNG_MASK                              0xC
#define _CPSBCON0_CPSBRM_POSN                               0x6
#define _CPSBCON0_CPSBRM_POSITION                           0x6
#define _CPSBCON0_CPSBRM_SIZE                               0x1
#define _CPSBCON0_CPSBRM_LENGTH                             0x1
#define _CPSBCON0_CPSBRM_MASK                               0x40
#define _CPSBCON0_CPSBON_POSN                               0x7
#define _CPSBCON0_CPSBON_POSITION                           0x7
#define _CPSBCON0_CPSBON_SIZE                               0x1
#define _CPSBCON0_CPSBON_LENGTH                             0x1
#define _CPSBCON0_CPSBON_MASK                               0x80
#define _CPSBCON0_CPSBRNG0_POSN                             0x2
#define _CPSBCON0_CPSBRNG0_POSITION                         0x2
#define _CPSBCON0_CPSBRNG0_SIZE                             0x1
#define _CPSBCON0_CPSBRNG0_LENGTH                           0x1
#define _CPSBCON0_CPSBRNG0_MASK                             0x4
#define _CPSBCON0_CPSBRNG1_POSN                             0x3
#define _CPSBCON0_CPSBRNG1_POSITION                         0x3
#define _CPSBCON0_CPSBRNG1_SIZE                             0x1
#define _CPSBCON0_CPSBRNG1_LENGTH                           0x1
#define _CPSBCON0_CPSBRNG1_MASK                             0x8

// Register: CPSBCON1
#define CPSBCON1 CPSBCON1
extern volatile unsigned char           CPSBCON1            __at(0x107);
#ifndef _LIB_BUILD
asm("CPSBCON1 equ 0107h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CPSBCH                 :4;
    };
    struct {
        unsigned CPSBCH0                :1;
        unsigned CPSBCH1                :1;
        unsigned CPSBCH2                :1;
        unsigned CPSBCH3                :1;
    };
} CPSBCON1bits_t;
extern volatile CPSBCON1bits_t CPSBCON1bits __at(0x107);
// bitfield macros
#define _CPSBCON1_CPSBCH_POSN                               0x0
#define _CPSBCON1_CPSBCH_POSITION                           0x0
#define _CPSBCON1_CPSBCH_SIZE                               0x4
#define _CPSBCON1_CPSBCH_LENGTH                             0x4
#define _CPSBCON1_CPSBCH_MASK                               0xF
#define _CPSBCON1_CPSBCH0_POSN                              0x0
#define _CPSBCON1_CPSBCH0_POSITION                          0x0
#define _CPSBCON1_CPSBCH0_SIZE                              0x1
#define _CPSBCON1_CPSBCH0_LENGTH                            0x1
#define _CPSBCON1_CPSBCH0_MASK                              0x1
#define _CPSBCON1_CPSBCH1_POSN                              0x1
#define _CPSBCON1_CPSBCH1_POSITION                          0x1
#define _CPSBCON1_CPSBCH1_SIZE                              0x1
#define _CPSBCON1_CPSBCH1_LENGTH                            0x1
#define _CPSBCON1_CPSBCH1_MASK                              0x2
#define _CPSBCON1_CPSBCH2_POSN                              0x2
#define _CPSBCON1_CPSBCH2_POSITION                          0x2
#define _CPSBCON1_CPSBCH2_SIZE                              0x1
#define _CPSBCON1_CPSBCH2_LENGTH                            0x1
#define _CPSBCON1_CPSBCH2_MASK                              0x4
#define _CPSBCON1_CPSBCH3_POSN                              0x3
#define _CPSBCON1_CPSBCH3_POSITION                          0x3
#define _CPSBCON1_CPSBCH3_SIZE                              0x1
#define _CPSBCON1_CPSBCH3_LENGTH                            0x1
#define _CPSBCON1_CPSBCH3_MASK                              0x8

// Register: CPSACON0
#define CPSACON0 CPSACON0
extern volatile unsigned char           CPSACON0            __at(0x108);
#ifndef _LIB_BUILD
asm("CPSACON0 equ 0108h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TAXCS                  :1;
        unsigned CPSAOUT                :1;
        unsigned CPSARNG                :2;
        unsigned                        :2;
        unsigned CPSARM                 :1;
        unsigned CPSAON                 :1;
    };
    struct {
        unsigned                        :2;
        unsigned CPSARNG0               :1;
        unsigned CPSARNG1               :1;
    };
} CPSACON0bits_t;
extern volatile CPSACON0bits_t CPSACON0bits __at(0x108);
// bitfield macros
#define _CPSACON0_TAXCS_POSN                                0x0
#define _CPSACON0_TAXCS_POSITION                            0x0
#define _CPSACON0_TAXCS_SIZE                                0x1
#define _CPSACON0_TAXCS_LENGTH                              0x1
#define _CPSACON0_TAXCS_MASK                                0x1
#define _CPSACON0_CPSAOUT_POSN                              0x1
#define _CPSACON0_CPSAOUT_POSITION                          0x1
#define _CPSACON0_CPSAOUT_SIZE                              0x1
#define _CPSACON0_CPSAOUT_LENGTH                            0x1
#define _CPSACON0_CPSAOUT_MASK                              0x2
#define _CPSACON0_CPSARNG_POSN                              0x2
#define _CPSACON0_CPSARNG_POSITION                          0x2
#define _CPSACON0_CPSARNG_SIZE                              0x2
#define _CPSACON0_CPSARNG_LENGTH                            0x2
#define _CPSACON0_CPSARNG_MASK                              0xC
#define _CPSACON0_CPSARM_POSN                               0x6
#define _CPSACON0_CPSARM_POSITION                           0x6
#define _CPSACON0_CPSARM_SIZE                               0x1
#define _CPSACON0_CPSARM_LENGTH                             0x1
#define _CPSACON0_CPSARM_MASK                               0x40
#define _CPSACON0_CPSAON_POSN                               0x7
#define _CPSACON0_CPSAON_POSITION                           0x7
#define _CPSACON0_CPSAON_SIZE                               0x1
#define _CPSACON0_CPSAON_LENGTH                             0x1
#define _CPSACON0_CPSAON_MASK                               0x80
#define _CPSACON0_CPSARNG0_POSN                             0x2
#define _CPSACON0_CPSARNG0_POSITION                         0x2
#define _CPSACON0_CPSARNG0_SIZE                             0x1
#define _CPSACON0_CPSARNG0_LENGTH                           0x1
#define _CPSACON0_CPSARNG0_MASK                             0x4
#define _CPSACON0_CPSARNG1_POSN                             0x3
#define _CPSACON0_CPSARNG1_POSITION                         0x3
#define _CPSACON0_CPSARNG1_SIZE                             0x1
#define _CPSACON0_CPSARNG1_LENGTH                           0x1
#define _CPSACON0_CPSARNG1_MASK                             0x8

// Register: CPSACON1
#define CPSACON1 CPSACON1
extern volatile unsigned char           CPSACON1            __at(0x109);
#ifndef _LIB_BUILD
asm("CPSACON1 equ 0109h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CPSACH                 :4;
    };
    struct {
        unsigned CPSACH0                :1;
        unsigned CPSACH1                :1;
        unsigned CPSACH2                :1;
        unsigned CPSACH3                :1;
    };
} CPSACON1bits_t;
extern volatile CPSACON1bits_t CPSACON1bits __at(0x109);
// bitfield macros
#define _CPSACON1_CPSACH_POSN                               0x0
#define _CPSACON1_CPSACH_POSITION                           0x0
#define _CPSACON1_CPSACH_SIZE                               0x4
#define _CPSACON1_CPSACH_LENGTH                             0x4
#define _CPSACON1_CPSACH_MASK                               0xF
#define _CPSACON1_CPSACH0_POSN                              0x0
#define _CPSACON1_CPSACH0_POSITION                          0x0
#define _CPSACON1_CPSACH0_SIZE                              0x1
#define _CPSACON1_CPSACH0_LENGTH                            0x1
#define _CPSACON1_CPSACH0_MASK                              0x1
#define _CPSACON1_CPSACH1_POSN                              0x1
#define _CPSACON1_CPSACH1_POSITION                          0x1
#define _CPSACON1_CPSACH1_SIZE                              0x1
#define _CPSACON1_CPSACH1_LENGTH                            0x1
#define _CPSACON1_CPSACH1_MASK                              0x2
#define _CPSACON1_CPSACH2_POSN                              0x2
#define _CPSACON1_CPSACH2_POSITION                          0x2
#define _CPSACON1_CPSACH2_SIZE                              0x1
#define _CPSACON1_CPSACH2_LENGTH                            0x1
#define _CPSACON1_CPSACH2_MASK                              0x4
#define _CPSACON1_CPSACH3_POSN                              0x3
#define _CPSACON1_CPSACH3_POSITION                          0x3
#define _CPSACON1_CPSACH3_SIZE                              0x1
#define _CPSACON1_CPSACH3_LENGTH                            0x1
#define _CPSACON1_CPSACH3_MASK                              0x8

// Register: PMDATL
#define PMDATL PMDATL
extern volatile unsigned char           PMDATL              __at(0x10C);
#ifndef _LIB_BUILD
asm("PMDATL equ 010Ch");
#endif

// Register: PMADRL
#define PMADRL PMADRL
extern volatile unsigned char           PMADRL              __at(0x10D);
#ifndef _LIB_BUILD
asm("PMADRL equ 010Dh");
#endif

