MikroElektronika/core_packages/PIC/XC8/def/PIC16F707/mcu.h
#define                                 CPSA3_bit           _BIT_ACCESS(PORTA,4)
// PORTA<CPSA4>
extern volatile __bit                   CPSA4               __at(0x2D);	// @ (0x5 * 8 + 5)
#define                                 CPSA4_bit           _BIT_ACCESS(PORTA,5)
// PORTE<CPSA5>
extern volatile __bit                   CPSA5               __at(0x48);	// @ (0x9 * 8 + 0)
#define                                 CPSA5_bit           _BIT_ACCESS(PORTE,0)
// PORTE<CPSA6>
extern volatile __bit                   CPSA6               __at(0x49);	// @ (0x9 * 8 + 1)
#define                                 CPSA6_bit           _BIT_ACCESS(PORTE,1)
// PORTE<CPSA7>
extern volatile __bit                   CPSA7               __at(0x4A);	// @ (0x9 * 8 + 2)
#define                                 CPSA7_bit           _BIT_ACCESS(PORTE,2)
// PORTD<CPSA8>
extern volatile __bit                   CPSA8               __at(0x43);	// @ (0x8 * 8 + 3)
#define                                 CPSA8_bit           _BIT_ACCESS(PORTD,3)
// PORTC<CPSA9>
extern volatile __bit                   CPSA9               __at(0x3D);	// @ (0x7 * 8 + 5)
#define                                 CPSA9_bit           _BIT_ACCESS(PORTC,5)
// CPSACON1<CPSACH0>
extern volatile __bit                   CPSACH0             __at(0x848);	// @ (0x109 * 8 + 0)
#define                                 CPSACH0_bit         _BIT_ACCESS(CPSACON1,0)
// CPSACON1<CPSACH1>
extern volatile __bit                   CPSACH1             __at(0x849);	// @ (0x109 * 8 + 1)
#define                                 CPSACH1_bit         _BIT_ACCESS(CPSACON1,1)
// CPSACON1<CPSACH2>
extern volatile __bit                   CPSACH2             __at(0x84A);	// @ (0x109 * 8 + 2)
#define                                 CPSACH2_bit         _BIT_ACCESS(CPSACON1,2)
// CPSACON1<CPSACH3>
extern volatile __bit                   CPSACH3             __at(0x84B);	// @ (0x109 * 8 + 3)
#define                                 CPSACH3_bit         _BIT_ACCESS(CPSACON1,3)
// CPSACON0<CPSAON>
extern volatile __bit                   CPSAON              __at(0x847);	// @ (0x108 * 8 + 7)
#define                                 CPSAON_bit          _BIT_ACCESS(CPSACON0,7)
// CPSACON0<CPSAOUT>
extern volatile __bit                   CPSAOUT             __at(0x841);	// @ (0x108 * 8 + 1)
#define                                 CPSAOUT_bit         _BIT_ACCESS(CPSACON0,1)
// CPSACON0<CPSARM>
extern volatile __bit                   CPSARM              __at(0x846);	// @ (0x108 * 8 + 6)
#define                                 CPSARM_bit          _BIT_ACCESS(CPSACON0,6)
// CPSACON0<CPSARNG0>
extern volatile __bit                   CPSARNG0            __at(0x842);	// @ (0x108 * 8 + 2)
#define                                 CPSARNG0_bit        _BIT_ACCESS(CPSACON0,2)
// CPSACON0<CPSARNG1>
extern volatile __bit                   CPSARNG1            __at(0x843);	// @ (0x108 * 8 + 3)
#define                                 CPSARNG1_bit        _BIT_ACCESS(CPSACON0,3)
// PORTA<CPSB0>
extern volatile __bit                   CPSB0               __at(0x2F);	// @ (0x5 * 8 + 7)
#define                                 CPSB0_bit           _BIT_ACCESS(PORTA,7)
// PORTA<CPSB1>
extern volatile __bit                   CPSB1               __at(0x2E);	// @ (0x5 * 8 + 6)
#define                                 CPSB1_bit           _BIT_ACCESS(PORTA,6)
// PORTB<CPSB10>
extern volatile __bit                   CPSB10              __at(0x32);	// @ (0x6 * 8 + 2)
#define                                 CPSB10_bit          _BIT_ACCESS(PORTB,2)
// PORTB<CPSB11>
extern volatile __bit                   CPSB11              __at(0x33);	// @ (0x6 * 8 + 3)
#define                                 CPSB11_bit          _BIT_ACCESS(PORTB,3)
// PORTB<CPSB12>
extern volatile __bit                   CPSB12              __at(0x34);	// @ (0x6 * 8 + 4)
#define                                 CPSB12_bit          _BIT_ACCESS(PORTB,4)
// PORTB<CPSB13>
extern volatile __bit                   CPSB13              __at(0x35);	// @ (0x6 * 8 + 5)
#define                                 CPSB13_bit          _BIT_ACCESS(PORTB,5)
// PORTB<CPSB14>
extern volatile __bit                   CPSB14              __at(0x36);	// @ (0x6 * 8 + 6)
#define                                 CPSB14_bit          _BIT_ACCESS(PORTB,6)
// PORTB<CPSB15>
extern volatile __bit                   CPSB15              __at(0x37);	// @ (0x6 * 8 + 7)
#define                                 CPSB15_bit          _BIT_ACCESS(PORTB,7)
// PORTC<CPSB2>
extern volatile __bit                   CPSB2               __at(0x38);	// @ (0x7 * 8 + 0)
#define                                 CPSB2_bit           _BIT_ACCESS(PORTC,0)
// PORTC<CPSB3>
extern volatile __bit                   CPSB3               __at(0x39);	// @ (0x7 * 8 + 1)
#define                                 CPSB3_bit           _BIT_ACCESS(PORTC,1)
// PORTC<CPSB4>
extern volatile __bit                   CPSB4               __at(0x3A);	// @ (0x7 * 8 + 2)
#define                                 CPSB4_bit           _BIT_ACCESS(PORTC,2)
// PORTD<CPSB5>
extern volatile __bit                   CPSB5               __at(0x40);	// @ (0x8 * 8 + 0)
#define                                 CPSB5_bit           _BIT_ACCESS(PORTD,0)
// PORTD<CPSB6>
extern volatile __bit                   CPSB6               __at(0x41);	// @ (0x8 * 8 + 1)
#define                                 CPSB6_bit           _BIT_ACCESS(PORTD,1)
// PORTD<CPSB7>
extern volatile __bit                   CPSB7               __at(0x42);	// @ (0x8 * 8 + 2)
#define                                 CPSB7_bit           _BIT_ACCESS(PORTD,2)
// PORTB<CPSB8>
extern volatile __bit                   CPSB8               __at(0x30);	// @ (0x6 * 8 + 0)
#define                                 CPSB8_bit           _BIT_ACCESS(PORTB,0)
// PORTB<CPSB9>
extern volatile __bit                   CPSB9               __at(0x31);	// @ (0x6 * 8 + 1)
#define                                 CPSB9_bit           _BIT_ACCESS(PORTB,1)
// CPSBCON1<CPSBCH0>
extern volatile __bit                   CPSBCH0             __at(0x838);	// @ (0x107 * 8 + 0)
#define                                 CPSBCH0_bit         _BIT_ACCESS(CPSBCON1,0)
// CPSBCON1<CPSBCH1>
extern volatile __bit                   CPSBCH1             __at(0x839);	// @ (0x107 * 8 + 1)
#define                                 CPSBCH1_bit         _BIT_ACCESS(CPSBCON1,1)
// CPSBCON1<CPSBCH2>
extern volatile __bit                   CPSBCH2             __at(0x83A);	// @ (0x107 * 8 + 2)
#define                                 CPSBCH2_bit         _BIT_ACCESS(CPSBCON1,2)
// CPSBCON1<CPSBCH3>
extern volatile __bit                   CPSBCH3             __at(0x83B);	// @ (0x107 * 8 + 3)
#define                                 CPSBCH3_bit         _BIT_ACCESS(CPSBCON1,3)
// CPSBCON0<CPSBON>
extern volatile __bit                   CPSBON              __at(0x837);	// @ (0x106 * 8 + 7)
#define                                 CPSBON_bit          _BIT_ACCESS(CPSBCON0,7)
// CPSBCON0<CPSBOUT>
extern volatile __bit                   CPSBOUT             __at(0x831);	// @ (0x106 * 8 + 1)
#define                                 CPSBOUT_bit         _BIT_ACCESS(CPSBCON0,1)
// CPSBCON0<CPSBRM>
extern volatile __bit                   CPSBRM              __at(0x836);	// @ (0x106 * 8 + 6)
#define                                 CPSBRM_bit          _BIT_ACCESS(CPSBCON0,6)
// CPSBCON0<CPSBRNG0>
extern volatile __bit                   CPSBRNG0            __at(0x832);	// @ (0x106 * 8 + 2)
#define                                 CPSBRNG0_bit        _BIT_ACCESS(CPSBCON0,2)
// CPSBCON0<CPSBRNG1>
extern volatile __bit                   CPSBRNG1            __at(0x833);	// @ (0x106 * 8 + 3)
#define                                 CPSBRNG1_bit        _BIT_ACCESS(CPSBCON0,3)
// RCSTA<CREN>
extern volatile __bit                   CREN                __at(0xC4);	// @ (0x18 * 8 + 4)
#define                                 CREN_bit            _BIT_ACCESS(RCSTA,4)
// TXSTA<CSRC>
extern volatile __bit                   CSRC                __at(0x4C7);	// @ (0x98 * 8 + 7)
#define                                 CSRC_bit            _BIT_ACCESS(TXSTA,7)
// DACCON0<DACEN>
extern volatile __bit                   DACEN               __at(0x89F);	// @ (0x113 * 8 + 7)
#define                                 DACEN_bit           _BIT_ACCESS(DACCON0,7)
// DACCON0<DACLPS>
extern volatile __bit                   DACLPS              __at(0x89E);	// @ (0x113 * 8 + 6)
#define                                 DACLPS_bit          _BIT_ACCESS(DACCON0,6)
// DACCON0<DACOE>
extern volatile __bit                   DACOE               __at(0x89D);	// @ (0x113 * 8 + 5)
#define                                 DACOE_bit           _BIT_ACCESS(DACCON0,5)
// PORTA<DACOUT>
extern volatile __bit                   DACOUT              __at(0x2A);	// @ (0x5 * 8 + 2)
#define                                 DACOUT_bit          _BIT_ACCESS(PORTA,2)
// DACCON0<DACPSS0>
extern volatile __bit                   DACPSS0             __at(0x89A);	// @ (0x113 * 8 + 2)
#define                                 DACPSS0_bit         _BIT_ACCESS(DACCON0,2)
// DACCON0<DACPSS1>
extern volatile __bit                   DACPSS1             __at(0x89B);	// @ (0x113 * 8 + 3)
#define                                 DACPSS1_bit         _BIT_ACCESS(DACCON0,3)
// DACCON1<DACR0>
extern volatile __bit                   DACR0               __at(0x8A0);	// @ (0x114 * 8 + 0)
#define                                 DACR0_bit           _BIT_ACCESS(DACCON1,0)
// DACCON1<DACR1>
extern volatile __bit                   DACR1               __at(0x8A1);	// @ (0x114 * 8 + 1)
#define                                 DACR1_bit           _BIT_ACCESS(DACCON1,1)
// DACCON1<DACR2>
extern volatile __bit                   DACR2               __at(0x8A2);	// @ (0x114 * 8 + 2)
#define                                 DACR2_bit           _BIT_ACCESS(DACCON1,2)
// DACCON1<DACR3>
extern volatile __bit                   DACR3               __at(0x8A3);	// @ (0x114 * 8 + 3)
#define                                 DACR3_bit           _BIT_ACCESS(DACCON1,3)
// DACCON1<DACR4>
extern volatile __bit                   DACR4               __at(0x8A4);	// @ (0x114 * 8 + 4)
#define                                 DACR4_bit           _BIT_ACCESS(DACCON1,4)
// STATUS<DC>
extern volatile __bit                   DC                  __at(0x19);	// @ (0x3 * 8 + 1)
#define                                 DC_bit              _BIT_ACCESS(STATUS,1)
// CCP1CON<DC1B0>
extern volatile __bit                   DC1B0               __at(0xBC);	// @ (0x17 * 8 + 4)
#define                                 DC1B0_bit           _BIT_ACCESS(CCP1CON,4)
// CCP1CON<DC1B1>
extern volatile __bit                   DC1B1               __at(0xBD);	// @ (0x17 * 8 + 5)
#define                                 DC1B1_bit           _BIT_ACCESS(CCP1CON,5)
// CCP2CON<DC2B0>
extern volatile __bit                   DC2B0               __at(0xEC);	// @ (0x1D * 8 + 4)
#define                                 DC2B0_bit           _BIT_ACCESS(CCP2CON,4)
// CCP2CON<DC2B1>
extern volatile __bit                   DC2B1               __at(0xED);	// @ (0x1D * 8 + 5)
#define                                 DC2B1_bit           _BIT_ACCESS(CCP2CON,5)
// PORTC<DT>
extern volatile __bit                   DT                  __at(0x3F);	// @ (0x7 * 8 + 7)
#define                                 DT_bit              _BIT_ACCESS(PORTC,7)
// SSPSTAT<D_nA>
extern volatile __bit                   D_nA                __at(0x4A5);	// @ (0x94 * 8 + 5)
#define                                 D_nA_bit            _BIT_ACCESS(SSPSTAT,5)
// RCSTA<FERR>
extern volatile __bit                   FERR                __at(0xC2);	// @ (0x18 * 8 + 2)
#define                                 FERR_bit            _BIT_ACCESS(RCSTA,2)
// FVRCON<FVREN>
extern volatile __bit                   FVREN               __at(0x4EE);	// @ (0x9D * 8 + 6)
#define                                 FVREN_bit           _BIT_ACCESS(FVRCON,6)
// FVRCON<FVRRDY>
extern volatile __bit                   FVRRDY              __at(0x4EF);	// @ (0x9D * 8 + 7)
#define                                 FVRRDY_bit          _BIT_ACCESS(FVRCON,7)
// INTCON<GIE>
extern volatile __bit                   GIE                 __at(0x5F);	// @ (0xB * 8 + 7)
#define                                 GIE_bit             _BIT_ACCESS(INTCON,7)
// ADCON0<GO_nDONE>
extern volatile __bit                   GO_nDONE            __at(0xF9);	// @ (0x1F * 8 + 1)
#define                                 GO_nDONE_bit        _BIT_ACCESS(ADCON0,1)
// OSCCON<ICSL>
extern volatile __bit                   ICSL                __at(0x483);	// @ (0x90 * 8 + 3)
#define                                 ICSL_bit            _BIT_ACCESS(OSCCON,3)
// OSCCON<ICSS>
extern volatile __bit                   ICSS                __at(0x482);	// @ (0x90 * 8 + 2)
#define                                 ICSS_bit            _BIT_ACCESS(OSCCON,2)
// INTCON<INTE>
extern volatile __bit                   INTE                __at(0x5C);	// @ (0xB * 8 + 4)
#define                                 INTE_bit            _BIT_ACCESS(INTCON,4)
// OPTION_REG<INTEDG>
extern volatile __bit                   INTEDG              __at(0x40E);	// @ (0x81 * 8 + 6)
#define                                 INTEDG_bit          _BIT_ACCESS(OPTION_REG,6)
// INTCON<INTF>
extern volatile __bit                   INTF                __at(0x59);	// @ (0xB * 8 + 1)
#define                                 INTF_bit            _BIT_ACCESS(INTCON,1)
// IOCB<IOCB0>
extern volatile __bit                   IOCB0               __at(0x4B0);	// @ (0x96 * 8 + 0)
#define                                 IOCB0_bit           _BIT_ACCESS(IOCB,0)
// IOCB<IOCB1>
extern volatile __bit                   IOCB1               __at(0x4B1);	// @ (0x96 * 8 + 1)
#define                                 IOCB1_bit           _BIT_ACCESS(IOCB,1)
// IOCB<IOCB2>
extern volatile __bit                   IOCB2               __at(0x4B2);	// @ (0x96 * 8 + 2)
#define                                 IOCB2_bit           _BIT_ACCESS(IOCB,2)
// IOCB<IOCB3>
extern volatile __bit                   IOCB3               __at(0x4B3);	// @ (0x96 * 8 + 3)
#define                                 IOCB3_bit           _BIT_ACCESS(IOCB,3)
// IOCB<IOCB4>
extern volatile __bit                   IOCB4               __at(0x4B4);	// @ (0x96 * 8 + 4)
#define                                 IOCB4_bit           _BIT_ACCESS(IOCB,4)
// IOCB<IOCB5>
extern volatile __bit                   IOCB5               __at(0x4B5);	// @ (0x96 * 8 + 5)
#define                                 IOCB5_bit           _BIT_ACCESS(IOCB,5)
// IOCB<IOCB6>
extern volatile __bit                   IOCB6               __at(0x4B6);	// @ (0x96 * 8 + 6)
#define                                 IOCB6_bit           _BIT_ACCESS(IOCB,6)
// IOCB<IOCB7>
extern volatile __bit                   IOCB7               __at(0x4B7);	// @ (0x96 * 8 + 7)
#define                                 IOCB7_bit           _BIT_ACCESS(IOCB,7)
// OSCCON<IRCF0>
extern volatile __bit                   IRCF0               __at(0x484);	// @ (0x90 * 8 + 4)
#define                                 IRCF0_bit           _BIT_ACCESS(OSCCON,4)
// OSCCON<IRCF1>
extern volatile __bit                   IRCF1               __at(0x485);	// @ (0x90 * 8 + 5)
#define                                 IRCF1_bit           _BIT_ACCESS(OSCCON,5)
// STATUS<IRP>
extern volatile __bit                   IRP                 __at(0x1F);	// @ (0x3 * 8 + 7)
#define                                 IRP_bit             _BIT_ACCESS(STATUS,7)
// RCSTA<OERR>
extern volatile __bit                   OERR                __at(0xC1);	// @ (0x18 * 8 + 1)
#define                                 OERR_bit            _BIT_ACCESS(RCSTA,1)
// PORTA<OSC1>
extern volatile __bit                   OSC1                __at(0x2F);	// @ (0x5 * 8 + 7)
#define                                 OSC1_bit            _BIT_ACCESS(PORTA,7)
// PORTA<OSC2>
extern volatile __bit                   OSC2                __at(0x2E);	// @ (0x5 * 8 + 6)
#define                                 OSC2_bit            _BIT_ACCESS(PORTA,6)
// INTCON<PEIE>
extern volatile __bit                   PEIE                __at(0x5E);	// @ (0xB * 8 + 6)
#define                                 PEIE_bit            _BIT_ACCESS(INTCON,6)
// OPTION_REG<PS0>
extern volatile __bit                   PS0                 __at(0x408);	// @ (0x81 * 8 + 0)
#define                                 PS0_bit             _BIT_ACCESS(OPTION_REG,0)
// OPTION_REG<PS1>
extern volatile __bit                   PS1                 __at(0x409);	// @ (0x81 * 8 + 1)
#define                                 PS1_bit             _BIT_ACCESS(OPTION_REG,1)
// OPTION_REG<PS2>
extern volatile __bit                   PS2                 __at(0x40A);	// @ (0x81 * 8 + 2)
#define                                 PS2_bit             _BIT_ACCESS(OPTION_REG,2)
// OPTION_REG<PSA>
extern volatile __bit                   PSA                 __at(0x40B);	// @ (0x81 * 8 + 3)
#define                                 PSA_bit             _BIT_ACCESS(OPTION_REG,3)
// PORTA<RA0>
extern volatile __bit                   RA0                 __at(0x28);	// @ (0x5 * 8 + 0)
#define                                 RA0_bit             _BIT_ACCESS(PORTA,0)
// PORTA<RA1>
extern volatile __bit                   RA1                 __at(0x29);	// @ (0x5 * 8 + 1)
#define                                 RA1_bit             _BIT_ACCESS(PORTA,1)
// PORTA<RA2>
extern volatile __bit                   RA2                 __at(0x2A);	// @ (0x5 * 8 + 2)
#define                                 RA2_bit             _BIT_ACCESS(PORTA,2)
// PORTA<RA3>
extern volatile __bit                   RA3                 __at(0x2B);	// @ (0x5 * 8 + 3)
#define                                 RA3_bit             _BIT_ACCESS(PORTA,3)
// PORTA<RA4>
extern volatile __bit                   RA4                 __at(0x2C);	// @ (0x5 * 8 + 4)
#define                                 RA4_bit             _BIT_ACCESS(PORTA,4)
// PORTA<RA5>
extern volatile __bit                   RA5                 __at(0x2D);	// @ (0x5 * 8 + 5)
#define                                 RA5_bit             _BIT_ACCESS(PORTA,5)
// PORTA<RA6>
extern volatile __bit                   RA6                 __at(0x2E);	// @ (0x5 * 8 + 6)
#define                                 RA6_bit             _BIT_ACCESS(PORTA,6)
// PORTA<RA7>
extern volatile __bit                   RA7                 __at(0x2F);	// @ (0x5 * 8 + 7)
#define                                 RA7_bit             _BIT_ACCESS(PORTA,7)
// PORTB<RB0>
extern volatile __bit                   RB0                 __at(0x30);	// @ (0x6 * 8 + 0)
#define                                 RB0_bit             _BIT_ACCESS(PORTB,0)
// PORTB<RB1>
extern volatile __bit                   RB1                 __at(0x31);	// @ (0x6 * 8 + 1)
#define                                 RB1_bit             _BIT_ACCESS(PORTB,1)
// PORTB<RB2>
extern volatile __bit                   RB2                 __at(0x32);	// @ (0x6 * 8 + 2)
#define                                 RB2_bit             _BIT_ACCESS(PORTB,2)
// PORTB<RB3>
extern volatile __bit                   RB3                 __at(0x33);	// @ (0x6 * 8 + 3)
#define                                 RB3_bit             _BIT_ACCESS(PORTB,3)
// PORTB<RB4>
extern volatile __bit                   RB4                 __at(0x34);	// @ (0x6 * 8 + 4)
#define                                 RB4_bit             _BIT_ACCESS(PORTB,4)
// PORTB<RB5>
extern volatile __bit                   RB5                 __at(0x35);	// @ (0x6 * 8 + 5)
#define                                 RB5_bit             _BIT_ACCESS(PORTB,5)
// PORTB<RB6>
extern volatile __bit                   RB6                 __at(0x36);	// @ (0x6 * 8 + 6)
#define                                 RB6_bit             _BIT_ACCESS(PORTB,6)
// PORTB<RB7>
extern volatile __bit                   RB7                 __at(0x37);	// @ (0x6 * 8 + 7)
#define                                 RB7_bit             _BIT_ACCESS(PORTB,7)
// INTCON<RBIE>
extern volatile __bit                   RBIE                __at(0x5B);	// @ (0xB * 8 + 3)
#define                                 RBIE_bit            _BIT_ACCESS(INTCON,3)
// INTCON<RBIF>
extern volatile __bit                   RBIF                __at(0x58);	// @ (0xB * 8 + 0)
#define                                 RBIF_bit            _BIT_ACCESS(INTCON,0)
// PORTC<RC0>
extern volatile __bit                   RC0                 __at(0x38);	// @ (0x7 * 8 + 0)
#define                                 RC0_bit             _BIT_ACCESS(PORTC,0)
// PORTC<RC1>
extern volatile __bit                   RC1                 __at(0x39);	// @ (0x7 * 8 + 1)
#define                                 RC1_bit             _BIT_ACCESS(PORTC,1)
// PORTC<RC2>
extern volatile __bit                   RC2                 __at(0x3A);	// @ (0x7 * 8 + 2)
#define                                 RC2_bit             _BIT_ACCESS(PORTC,2)
// PORTC<RC3>
extern volatile __bit                   RC3                 __at(0x3B);	// @ (0x7 * 8 + 3)
#define                                 RC3_bit             _BIT_ACCESS(PORTC,3)
// PORTC<RC4>
extern volatile __bit                   RC4                 __at(0x3C);	// @ (0x7 * 8 + 4)
#define                                 RC4_bit             _BIT_ACCESS(PORTC,4)
// PORTC<RC5>
extern volatile __bit                   RC5                 __at(0x3D);	// @ (0x7 * 8 + 5)
#define                                 RC5_bit             _BIT_ACCESS(PORTC,5)
// PORTC<RC6>
extern volatile __bit                   RC6                 __at(0x3E);	// @ (0x7 * 8 + 6)
#define                                 RC6_bit             _BIT_ACCESS(PORTC,6)
// PORTC<RC7>
extern volatile __bit                   RC7                 __at(0x3F);	// @ (0x7 * 8 + 7)
#define                                 RC7_bit             _BIT_ACCESS(PORTC,7)
// PIE1<RCIE>
extern volatile __bit                   RCIE                __at(0x465);	// @ (0x8C * 8 + 5)
#define                                 RCIE_bit            _BIT_ACCESS(PIE1,5)
// PIR1<RCIF>
extern volatile __bit                   RCIF                __at(0x65);	// @ (0xC * 8 + 5)
#define                                 RCIF_bit            _BIT_ACCESS(PIR1,5)
// PMCON1<RD>
extern volatile __bit                   RD                  __at(0xC60);	// @ (0x18C * 8 + 0)
#define                                 RD_bit              _BIT_ACCESS(PMCON1,0)
// PORTD<RD0>
extern volatile __bit                   RD0                 __at(0x40);	// @ (0x8 * 8 + 0)
#define                                 RD0_bit             _BIT_ACCESS(PORTD,0)
// PORTD<RD1>
extern volatile __bit                   RD1                 __at(0x41);	// @ (0x8 * 8 + 1)
#define                                 RD1_bit             _BIT_ACCESS(PORTD,1)
// PORTD<RD2>
extern volatile __bit                   RD2                 __at(0x42);	// @ (0x8 * 8 + 2)
#define                                 RD2_bit             _BIT_ACCESS(PORTD,2)
// PORTD<RD3>
extern volatile __bit                   RD3                 __at(0x43);	// @ (0x8 * 8 + 3)
#define                                 RD3_bit             _BIT_ACCESS(PORTD,3)
// PORTD<RD4>
extern volatile __bit                   RD4                 __at(0x44);	// @ (0x8 * 8 + 4)
#define                                 RD4_bit             _BIT_ACCESS(PORTD,4)
// PORTD<RD5>
extern volatile __bit                   RD5                 __at(0x45);	// @ (0x8 * 8 + 5)
#define                                 RD5_bit             _BIT_ACCESS(PORTD,5)
// PORTD<RD6>
extern volatile __bit                   RD6                 __at(0x46);	// @ (0x8 * 8 + 6)
#define                                 RD6_bit             _BIT_ACCESS(PORTD,6)
// PORTD<RD7>
